# Read, Write Files

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame(data=[[2,3],
                        ["Hello", "World"],
                        [34, True]],
                 index = ['R1', 'R2', 'R3'])

## .csv

In [3]:
df.to_csv('samplecsv.csv') #Write to .csv file

In [4]:
df1 = pd.read_csv('samplecsv.csv') #Read .csv file

In [5]:
df1

  Unnamed: 0      0      1
0         R1      2      3
1         R2  Hello  World
2         R3     34   True

In [7]:
df1 = pd.read_csv('samplecsv.csv', index_col=0)
#0th column is not a particular column, but index column

In [8]:
df1

        0      1
R1      2      3
R2  Hello  World
R3     34   True

## .html

In [ ]:
# https://en.wikipedia.org/wiki/The_World%27s_Billionaires

In [14]:
list_of_tables = pd.read_html('https://en.wikipedia.org/wiki/The_World%27s_Billionaires')
#returns list and not DataFrame
#Returns tables of that page

In [15]:
type(list_of_tables)

list

In [16]:
len(list_of_tables)

26

In [18]:
list_of_tables[1]

,0,1,2,3,4,5
0,No.,Name,Net worth (USD),Age,Nationality,Source(s) of wealth
1,7000100000000000000♠1,"Gates, BillBill Gates",$86.0 billion,61,United States,Microsoft
2,7000200000000000000♠2,"Buffett, WarrenWarren Buffett",$75.6 billion,86,United States,Berkshire Hathaway
3,7000300000000000000♠3,"Bezos, JeffJeff Bezos",$72.8 billion,53,United States,Amazon.com
4,7000400000000000000♠4,"Ortega, AmancioAmancio Ortega",$71.3 billion,80,Spain,"Inditex, Zara"
5,7000500000000000000♠5,"Zuckerberg, MarkMark Zuckerberg",$56.0 billion,32,United States,Facebook
6,7000600000000000000♠6,"Slim, CarlosCarlos Slim",$54.5 billion,77,Mexico,"América Móvil, Grupo Carso"
7,7000700000000000000♠7,"Ellison, LarryLarry Ellison",$52.2 billion,72,United States,Oracle Corporation
8,7000800000000000000♠8,"Koch, CharlesCharles Koch",$48.3 billion,81,United States,Koch Industries
9,7000800000000000000♠8,"Koch, DavidDavid Koch",$48.3 billion,76,United States,Koch Industries
10,7001100000000000000♠10,"Bloomberg, MichaelMichael Bloomberg",$47.5 billion,75,United States,Bloomberg L.P.

## excel

In [19]:
df

        0      1
R1      2      3
R2  Hello  World
R3     34   True

In [20]:
df.to_excel('sampleExcel.xls') #Write to excel file